data/templates/soap/connector2bridge_base.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:urn="urn:xeu:connector-bridge:v1"
                  xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ urn:xeu:connector-bridge:v1">
  <soapenv:Body>
    <ns11:Connector2BridgeRequest xmlns:ns11="urn:xeu:bridge-connector:v1"
                                  xmlns="urn:un:unece:uncefact:data:standard:ReusableAggregateBusinessInformationEntity:20"
                                  xmlns:ns10="urn:xeu:flux-transport:v1"
                                  xmlns:ns2="urn:un:unece:uncefact:data:standard:UnqualifiedDataType:20"
                                  xmlns:ns3="urn:un:unece:uncefact:data:standard:FLUXFAReportMessage:3"
                                  xmlns:ns4="urn:un:unece:uncefact:data:standard:FLUXResponseMessage:6"
                                  xmlns:ns5="urn:un:unece:uncefact:data:standard:FLUXVesselQueryMessage:5"
                                  xmlns:ns6="urn:un:unece:uncefact:data:standard:FLUXFAQueryMessage:3"
                                  xmlns:ns7="urn:xeu:connector-bridge:v1"
                                  xmlns:ns8="http://ec.europa.eu/fisheries/schema/ers/v3"
                                  xmlns:ns9="urn:xeu:bridge-connector:callback:v1"
                                  AD="XFA" AR="false" DF="urn:un:unece:uncefact:fisheries:FLUX:FA:EU:2"
                                  FR="SRC:ALTIA" ON="SRCXFA2021921424247" TO="60"
                                  TODT="2021-12-13T14:00:10Z" VB="error">

      <rsm:FLUXISRMessage xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                          xsi:schemaLocation="urn:un:unece:uncefact:data:standard:FLUXISRMessage:8 ../uncefact/data/standard/FLUXISRMessage_8p0.xsd"
                          xmlns:udt="urn:un:unece:uncefact:data:standard:UnqualifiedDataType:31"
                          xmlns:rsm="urn:un:unece:uncefact:data:standard:FLUXISRMessage:8"
                          xmlns:ram="urn:un:unece:uncefact:data:standard:ReusableAggregateBusinessInformationEntity:31">

        <rsm:FLUXReportDocument>
          <ram:ID schemeID="UUID">{{myGUID}}</ram:ID>
          <ram:CreationDateTime>
            <udt:DateTime>2021-12-13T12:57:10.942Z</udt:DateTime>
          </ram:CreationDateTime>
          <ram:PurposeCode listID="FLUX_GP_PURPOSE">9</ram:PurposeCode>
          <ram:Purpose>FA-L02-00-0256_001</ram:Purpose>
          <ram:OwnerFLUXParty>
            <ram:ID schemeID="FLUX_GP_PARTY">SRC</ram:ID>
          </ram:OwnerFLUXParty>
        </rsm:FLUXReportDocument>

        <rsm:FAReportDocument>
          <ram:TypeCode listID="FLUX_FA_REPORT_TYPE">DECLARATION</ram:TypeCode>
          <ram:AcceptanceDateTime>
            <udt:DateTime>2021-12-13T07:57:10.942Z</udt:DateTime>
          </ram:AcceptanceDateTime>

          <ram:RelatedFLUXReportDocument>
            <ram:ID schemeID="UUID">{{myGUID2}}</ram:ID>
            <ram:CreationDateTime>
              <udt:DateTime>2021-12-13T09:57:10.942Z</udt:DateTime>
            </ram:CreationDateTime>
            <ram:PurposeCode listID="FLUX_GP_PURPOSE">9</ram:PurposeCode>
            <ram:OwnerFLUXParty>
              <ram:ID schemeID="FLUX_GP_PARTY">SRC</ram:ID>
            </ram:OwnerFLUXParty>
          </ram:RelatedFLUXReportDocument>

          <!-- BLOQUE REPETIBLE (se inyecta desde k6) -->
          {{ACTIVITIES_BLOCK}}

          <!-- El resto del XML se queda tal cual -->
          <ram:SpecifiedVesselTransportMeans>
            <ram:ID schemeID="CFR">CYP123452222</ram:ID>
            <ram:Name>GOLF</ram:Name>
            <ram:RoleCode listID="FA_VESSEL_ROLE">PAIR_FISHING_PARTNER</ram:RoleCode>
            <ram:RegistrationVesselCountry>
              <ram:ID schemeID="TERRITORY">CYP</ram:ID>
            </ram:RegistrationVesselCountry>
            <ram:SpecifiedContactParty>
              <ram:RoleCode listID="FLUX_CONTACT_ROLE">MASTER</ram:RoleCode>
              <ram:SpecifiedStructuredAddress>
                <ram:StreetName>ll</ram:StreetName>
                <ram:CityName>CABOURG</ram:CityName>
                <ram:CountryID schemeID="TERRITORY">ESP</ram:CountryID>
                <ram:PlotIdentification>17</ram:PlotIdentification>
                <ram:PostalArea>14390</ram:PostalArea>
              </ram:SpecifiedStructuredAddress>
              <ram:SpecifiedContactPerson>
                <ram:GivenName>Jack Kelly</ram:GivenName>
                <ram:FamilyName>E</ram:FamilyName>
                <ram:Alias>kell</ram:Alias>
              </ram:SpecifiedContactPerson>
            </ram:SpecifiedContactParty>
          </ram:SpecifiedVesselTransportMeans>

        </rsm:FAReportDocument>
      </rsm:FLUXISRMessage>
    </ns11:Connector2BridgeRequest>
  </soapenv:Body>
</soapenv:Envelope>
